Tekla Open API Reference for Tekla Structures 2025
ReinforcementStrandAttributes Constructor
Overload List
Name | Description
ReinforcementBase.ReinforcementStrandAttributes()
 Creates a new default reinforcement attributes instance that loads standard attributes.
ReinforcementBase.ReinforcementStrandAttributes(Boolean)
 Creates a new default reinforcement attributes instance that loads standard attributes. If it set to true attributes won't be lodaded.
ReinforcementBase.ReinforcementStrandAttributes(String)
 Creates a new reinforcement attributes instance that loads the specified attributes.
Top
See Also
Reference
ReinforcementBase.ReinforcementStrandAttributes Class
Tekla.Structures.Drawing Namespace